In [2]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [3]:
!pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5583 sha256=e3b88579adfae68dcd893b5ed10fd026543d5a34ec3368a606cae9a0124c5ff0
  Stored in directory: c:\users\user\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [4]:
from word2number import w2n

In [5]:
d=pd.read_csv("hr.csv")
d

  experience  test_score  int_score  salary
0        NaN         8.0          9   50000
1        NaN         8.0          6   45000
2       five         6.0          7   60000
3        two        10.0         10   65000
4      seven         9.0          6   70000
5      three         7.0         10   62000
6        ten         NaN          7   72000
7     eleven         7.0          8   80000

In [6]:
d.experience=d.experience.fillna("zero")
d

  experience  test_score  int_score  salary
0       zero         8.0          9   50000
1       zero         8.0          6   45000
2       five         6.0          7   60000
3        two        10.0         10   65000
4      seven         9.0          6   70000
5      three         7.0         10   62000
6        ten         NaN          7   72000
7     eleven         7.0          8   80000

In [7]:
d.experience=d.experience.apply(w2n.word_to_num)
d

   experience  test_score  int_score  salary
0           0         8.0          9   50000
1           0         8.0          6   45000
2           5         6.0          7   60000
3           2        10.0         10   65000
4           7         9.0          6   70000
5           3         7.0         10   62000
6          10         NaN          7   72000
7          11         7.0          8   80000

In [11]:
import math
median_test_score=math.floor(d['test_score'].mean())
print(median_test_score)
d['test_score']=d['test_score'].fillna(median_test_score)
d

7

   experience  test_score  int_score  salary
0           0         8.0          9   50000
1           0         8.0          6   45000
2           5         6.0          7   60000
3           2        10.0         10   65000
4           7         9.0          6   70000
5           3         7.0         10   62000
6          10         7.0          7   72000
7          11         7.0          8   80000

In [13]:
reg = linear_model.LinearRegression()
reg.fit(d[['experience','test_score','int_score']],d.salary)

LinearRegression()

In [14]:
reg.predict([[2,10,10]])

C:\Users\user\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([64525.1061363])

In [15]:
reg.predict([[12,10,10]])

C:\Users\user\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([93747.79628651])